import { DropdownOptions } from '../types';

export const DEFAULT_DROPDOWN_OPTIONS: DropdownOptions = {
  programTypes: [
    'আলোচনা চক্র',
    'পাঠ চক্র',
    'কুরআন ক্লাস',
    'হাদীস ক্লাস',
    'কর্মী বৈঠক'
  ],
  wards: [
    '১৩ উত্তর',
    '১৩ দক্ষিণ',
    'সেগুনবাগিচা',
    'স্কুল ওয়ার্ড'
  ],
  mans: ['সমর্থক', 'কর্মী', 'সাথী', 'সদস্য'],
  tags: [
    'উপশাখা দায়িত্বশীল',
    'ওয়ার্ড দায়িত্বশীল',
    'থানা দায়িত্বশীল',
    'থানা সেক্রেটারিয়েট',
    'ওয়ার্ড সভাপতি',
    'ওয়ার্ড সেক্রেটারি',
    'ওয়ার্ড বিএম',
    'উপশাখা সভাপতি',
    'উপশাখা সেক্রেটারি',
    'উপশাখা বিএম'
  ],
  uposhakhas: [
    'পিডবলুডি',
    'শান্তিনগর বাজার',
    'স্টার্ন প্লাস',
    'চামেলিবাগ',
    'রাজারবাগ',
    'টুইনটাওয়ার'
  ],
  chutis: ['কিছুক্ষণ', 'প্রোগ্রাম', 'ছুটি ছাড়া'],
  levels: ['school', 'college', 'university', 'masters']
};

export const DEFAULT_SELECT = 'নির্বাচন করুন';
